Revit 2024 API
ConnectionInputPointInfo.RestrictionType Property
 A type of input point restriction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public string RestrictionType { get; set; }
Visual Basic
Public Property RestrictionType As String
	Get
	Set
Visual C++
public:
property String^ RestrictionType {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace